web/load-tests/api.yml
config:
  target: "http://127.0.0.1:5230"
  phases:
    - duration: 10
      arrivalRate: 10
      name: Warm up
    - duration: 30
      arrivalRate: 50
      name: High load on API
scenarios:
  - name: "Fetch API endpoints"
    flow:
      - get:
          url: "/healthz"
      - get:
          url: "/healthz"